# Дана строка текста, необходимо сформировать из нее две новых строки
# из символов которые стоят на четных позициях и на нечетных
my_str = input("Ввидите строку:")
print(my_str)
print(my_str[1::2])
print(my_str[::2])
